torScoreApp.directive('scala', ['$state', '$rootScope', function ($state, $rootScope) {
    return {
        restrict: 'E',
        templateUrl: './directives/scala/scala.html',
        link: function (scope, el, attrs) {
            if (attrs.type == "service") {
                scope.title = "הגשה";
                scope.fieldsData = [{ id: 1, name: 'הגשה ושירות', options: [{ name: 'הצגת התפריט באזור ההגשה' }, { name: 'שילוט המנות' }, { name: 'שירותיות עובדי ההגשה ובקיאותם בתפריט' }, { name: 'זמן המתנה למנה עיקרית / בקופה ' }, { name: 'זמינות המנות' }, { name: 'זמינות כלי אוכל לסועד' }, { name: 'פינוי וניקוי שולחנות במהלך הארוחה'}] },

            { id: 2, name: 'קולינריה', options: [{ name: 'מידת האטרקטיביות של פינת השף' }, { name: 'התאמה קולינרית בין המנות בארוחה '}] },

            { id: 3, name: 'אסתטיקה בהגשה', options: [{ name: 'חזות עובד ההגשה' }, { name: 'אופן מילוי פסי החלוקה' }, { name: 'התאמת כלי ההגשה למנה: מלקחיים, מצקת, כף, כף מחוררת' }, { name: 'מראה פס עיקרי' }, { name: 'מראה פס תוספות' }, { name: 'מראה בר ירקות וסלטים' }, { name: 'מראה עמדת רטבים' }, { name: 'מראה בר קינוחים' }, { name: 'מראה בר לחמים' }, { name: 'מראה עמדת שתייה'}] },

            { id: 4, name: 'ניקיון סביבת השירות', options: [{ name: 'חצר ההגשה' }, { name: 'אזור ישיבת הסועדים' }, { name: 'צלחות' }, { name: 'סכו"ם' }, { name: 'כוסות' }, { name: 'מגשים'}] },

            { id: 5, name: 'תפריט והתאמה להסכם', options: [{ name: 'תפריט מאושר' }, { name: 'התאמת התפריט המוגש לתפריט המאושר ' }, { name: 'התאמת התפריט המוגש להסכם' }, { name: 'שימוש בחומרי גלם מאושרים' }, { name: 'התאמה להנחיות התזונתיות והבריאותיות בהסכם (פירוט להלן)'}] },

            { id: 6, name: 'התאמה להנחיות התזונתיות והבריאותיות ', options: [{ name: 'כמות השומן לאדם בארוחה לא עולה על 16 גרם' }, { name: 'הימנעות משומן טראנס (שומן צמחי מוקשה או מוקשה חלקית, מרגרינה)' }, { name: 'כמות הנתרן לאדם בארוחה לא עולה על 1.5 גרם' }, { name: 'הימנעות מתוספי מזון אסורים' }, { name: 'הימנעות מאבקות מהירות הכנה, אבקות מרק, ביצים משומרות או נוזל ביצים' }, { name: 'המרקים מתוצרת עצמית בלבד' }, { name: 'הירקניות מירקות טריים, מאודים או אפויים; לכל היותר ירקנית אחת מירק קפוא' }, { name: 'אותו ירק לא מופיע ביותר משתי מנות' }, { name: 'סלט אחד לכל היותר מכיל מיונז' }, { name: 'אחת הפחמימות מדגן מלא' }, { name: 'תוספת אחת לפחות מכילה קטניות' }, { name: 'מנה עיקרית אחת מופחתת קלוריות' }, { name: 'משקל החלבון במנה צמחונית 20 גרם לפחות' }, { name: 'לכל היותר שתי מנות עיקריות מטוגנות, כולל שניצל ' }, { name: 'רכיב בסיסי במנה עיקרית לא מופיע יותר מפעם אחת' }, { name: 'מוצרי הבשר אינם מעובדים, ללא תוספים או מים' }, { name: 'תוספת של סויה למנה עיקרית משולטת; תוספת הסויה מוגבלת ל-10% ממשקל המנה' }, { name: 'מנות הדגים מדג גולמי בלבד, פילה או דג שלם' }, { name: 'לפחות קינוח אחד לא מכיל שומן טראנס; אחד הקינוחים מתבסס על פירות או ירקות טריים' }, { name: 'לצד הפחמימות מוצע רוטב מתאים בהגשה עצמית' }, { name: 'לפחות שני רטבים בייצור עצמי מוצעים בעמדת הרטבים' }, { name: 'מוצע לימון טרי פרוס (למעט עד 30 יום בשנה. חוסר בתיאום נחשב לחוסר בפריט) ' }, { name: 'בימים שאין לימון טרי מוצע מיץ לימון או חומץ בן יין או חומץ בלסמי'}] },
            { id: 7, name: 'ניקיון סביבת השירות', options: [{ name: 'חצר ההגשה' }, { name: 'אזור ישיבת הסועדים' }, { name: 'צלחות' }, { name: 'סכו"ם' }, { name: 'כוסות' }, { name: 'מגשים'}]}]
            }
            else {

                scope.title = "סנטציה";
                scope.fieldsData = [{ id: 1, name: 'ניקיון וסדר', options: [{ name: 'ניקיון ציוד בישול כולל תנורים, קומבי, ארון חימום' }, { name: 'ניקיון משטחי עבודה כולל בין תהליכים' }, { name: 'תקינות וחיטוי קרשי חיתוך ' }, { name: 'ניקיון מקררים ומקפיאים' }, { name: 'ניקיון וסדר מחסן יבש' }, { name: 'ניקיון חדר שטיפה' }, { name: 'ניקיון הרצפה' }, { name: 'ניקיון ותקינות דיספנסרים ומערכת ניקוז ' }, { name: 'ניקיון ותקינות כיורים וברזים' }, { name: 'סבוניות מלאות, מברשת לציפורניים ונייר ניגוב חד-פעמי ליד הכיורים' }, { name: 'ניקיון ותקינות מדפים ועגלות' }, { name: 'ניקיון דלתות, קירות ומתגי חשמל' }, { name: 'ניקיון תקרות' }, { name: 'ניקיון מלתחות ושירותי עובדים' }, { name: 'ניקיון ותקינות רכב שינוע'}] },

            { id: 2, name: 'היגיינה אישית', options: [{ name: 'היגיינת עובדים: בריאות תקינה, גילוח, ציפורניים נקיות וגזוזות, שימוש בדאודורנט' }, { name: 'לבוש מתאים לעובדים: בגדי עבודה נקיים, נעלי בטיחות, כיסוי ראש, ללא תכשיטים' }, { name: 'החזקת טלפון סלולרי או עישון באזורי עבודה' }, { name: 'רחיצת ידיים בהתאם לנהלים הדרושים' }, { name: 'עבודה בכפפות והחלפתן' }, { name: 'אנשים זרים במטבח'}] },

            { id: 3, name: 'תהליכי ייצור', options: [{ name: 'מודעות העובדים להיגיינה, בטיחות מזון ונוהלי עבודה תקינים ' }, { name: 'זיהומים צולבים' }, { name: 'ייצור המזון במדורים המתאימים' }, { name: 'חיטוי ושטיפת ירקות' }, { name: 'בקרת טמפרטורה ותיעודה במקררים ובמקפיאים' }, { name: 'תיעוד החלפת שמן במטגנות' }, { name: 'שמן במטגנות: בדיקת TPM מתחת ל-25%' }, { name: 'שמירת דוגמיות מזון 72 שעות, כולל רישום שם המנה ושעת דגימה' }, { name: 'קיום בדיקות מעבדה ' }, { name: 'מחזור מזון' }, { name: 'תקינות ציוד' }, { name: 'ממצאים אורגנולפטיים חריגים' }, { name: 'הגשת מנות בטמפרטורות הנדרשות' }, { name: 'בדיקת טמפרטורה בקבלת מזון'}] },

            { id: 4, name: 'אחסון', options: [{ name: 'קירור נפרד לחומרי גלם, הפשרה, מזון בתהליך ומזון מוכן' }, { name: 'כיסוי תקין וסימון מזון מוכן ומזון בתהליך בתאריכי הכנה ותפוגה' }, { name: 'אחסון מזון יבש כנדרש: על מדפים, באריזות שלמות וסגורות, מסומן בתכולה ובתאריכי תפוגה' }, { name: 'הימצאות מוצרים שפג תוקפם' }, { name: 'אחסון תבלינים במכלים סגורים ונקיים ומסומנים בתאריכי תפוגה ' }, { name: 'אחסון מזון מוכן שהוקפא ' }, { name: 'אחסון ביצים בנפרד' }, { name: 'אחסון כלי אוכל' }, { name: 'אחסון ציוד: סכינים, סכיני מכונות חיתוך, קרשי חיתוך' }, { name: 'אחסון אריזות takeaway וכלים חד-פעמיים במקום נקי ובנפרד'}] },

            { id: 5, name: 'תפריט והתאמה להסכם', options: [{ name: 'תפריט מאושר' }, { name: 'התאמת התפריט המוגש לתפריט המאושר ' }, { name: 'התאמת התפריט המוגש להסכם' }, { name: 'שימוש בחומרי גלם מאושרים' }, { name: 'התאמה להנחיות התזונתיות והבריאותיות בהסכם (פירוט להלן)'}] },



            { id: 6, name: 'פסולת ', options: [{ name: 'ניקיון פחי אשפה במטבח והחלפת שקיות לאחר כל פינוי' }, { name: 'תדירות פינוי פסולת מהמטבח לחדר אשפה' }, { name: 'מחזור: הפרדת הפסולת לסוגיה' }, { name: 'ניקיון חדר אשפה' }, { name: 'ניקיון החצר'}]}]

            }

            scope.fieldsOpenStatus = [false, false, false]//set the open/close accordion
            scope.oneAtATime = true;
            scope.arrowDaown = false;
            scope.text = 'test'
            if (attrs.type == "sanitation") {
                scope.text = 'sanittion'
            }
            else if (attrs.type == "service") {
                scope.text = 'service'
            }


            scope.finish = function () {
                alert('המידע נשמר!')
                $state.transitionTo('summary');
            }
            scope.exit = function () {
                $state.transitionTo('summary');
            }

        },
        replace: true
    };


} ]);

