odtechApp.directive('navigation', [ function () {
    return {
        restrict: 'E',
        templateUrl: './features/navigation/navigation.html',
        link: function (scope, el, attrs) {           
        },
        replace: true
    };

    //איתחול המפה עם הקודינטות של המשימה.
    //מירכזו מיקומי על המסך
    //טיפול במצב של גיפאס סגור
    //הצבת המיקום שלי ומיקום היעד
    //במידה והמפה נטענת מאוחר
    //, להציב גם את היעד וגם את המיקום תמיד..
    //לזהות התקדמות של המיקום שלי ולעדכן על המפה
    //זיהוי התקרבות לנקודת היעד והצגת פופאפ סיום
    //
    //כניסה אחרי ביצוע,
    //מציג את הנקודות ואת המפה

} ]);