//var categories = [{ id: 0, name: '' },{ id: 1, name: 'בקר' }, { id: 2, name: 'מוקפץ' }, { id: 3, name: 'סלטים מורכבים' }, { id: 4, name: 'קטניות' },
//     { id: 5, name: 'דגים' }, { id: 6, name: 'רטבים' }, { id: 7, name: 'גבינות' }, { id: 8, name: 'מאפים' }
//     , { id: 9, name: 'צמחוני/טבעוני' }, { id: 10, name: 'עמדת שף' }, { id: 11, name: 'תיבול' }, { id: 12, name: 'דגני בוקר ודייסה' }
//      , { id: 13, name: 'עוף והודו' }, { id: 14, name: 'קינוח' }, { id: 15, name: 'פירות' }, { id: 16, name: 'מרקים' }
//      , { id: 17, name: 'מבוסס פרי' }, { id: 18, name: 'שתיה' }, { id: 19, name: 'עיקרית לסלט וכריך' }
//      , { id: 20, name: 'תוספות למרק' }, { id: 21, name: 'פחמימות' }, { id: 22, name: 'ממרחים' }, { id: 23, name: 'צמחוניות וביצים' },
//       { id: 24, name: 'מעדנים' }, { id: 25, name: 'חלבי חם' }, { id: 26, name: 'לחמים' }, { id: 27, name: 'ירקניות' }, { id: 28, name: 'לא קיים' }, { id: 29, name: 'תפריט'}]


var categories = [{ id: 0, name: '' },
{ id: 16, name: 'מרקים' }, 
 { id: 20, name: 'תוספות למרק' },
 { id: 26, name: 'לחמים' },

{ id: 31, name: 'בר ירקות' },
{ id: 28, name: 'פחמימות בבר ירקות' },
 { id: 3, name: 'סלטים מורכבים' },
 { id: 22, name: 'ממרחים' }, 
 { id: 21, name: 'פחמימות' },
 { id: 4, name: 'קטניות' },
 { id: 27, name: 'ירקניות' },
 { id: 2, name: 'מוקפץ' },
  //{ id: 19, name: 'עיקרית לסלט וכריך' },
  { id: 10, name: 'עמדת שף' }, 
 { id: 23, name: 'צמחוניות וביצים' },
 { id: 13, name: 'עוף והודו' },
 { id: 1, name: 'בקר' }, 
 { id: 5, name: 'דגים' },
   { id: 25, name: 'חלבי חם' },
    { id: 12, name: 'דגני בוקר ודייסה' },
    { id: 7, name: 'גבינות' },
     { id: 24, name: 'מעדנים' }, 
    { id: 14, name: 'קינוח' },
     { id: 17, name: 'מבוסס פרי' }, 
     { id: 15, name: 'פירות' },
     { id: 8, name: 'מאפים' },
      { id: 6, name: 'רטבים' }, 
     { id: 11, name: 'תיבול' }, 
      { id: 18, name: 'שתיה' },
       { id: 29, name: 'תפריט' }, 
      { id: 30, name: 'הערות' }
]